solvers/openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

// Cold rectangular-duct smoke case. Not a rotating fan.
application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         50;
deltaT          1;

writeControl    timeStep;
writeInterval   25;
purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;
