solvers/openfoam/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Straight rectangular duct, 0.08 m x 0.08 m x 0.22 m.
// Same length scale as the fan duct in cases/ducted-fan-1kn/intent.yaml.
// This is not the impeller passage. Do not integrate forces and call them thrust.
scale   1;

vertices
(
    (0    0    0   ) // 0
    (0.08 0    0   ) // 1
    (0.08 0.08 0   ) // 2
    (0    0.08 0   ) // 3
    (0    0    0.22) // 4
    (0.08 0    0.22) // 5
    (0.08 0.08 0.22) // 6
    (0    0.08 0.22) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (16 16 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 6 7 3)
            (0 4 7 3)
        );
    }
);

mergePatchPairs
(
);
