solvers/openfoam/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Air, kinematic viscosity, order-of-magnitude at room temperature.
// Incompressible simpleFoam: pressure in the 0/p file is p/rho (m^2/s^2), not pascals.
transportModel  Newtonian;

nu              1.5e-05;
