solvers/openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

// 5 m/s axial placeholder. Not the fan operating point in intent.yaml.
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 5);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 5);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 5);
    }
    walls
    {
        type            noSlip;
    }
}
