solvers/openfoam/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

// Placeholder for U=5 m/s and intensity 5%: k = 1.5*(U*I)^2 ≈ 0.094.
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.094;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.094;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.094;
        value           uniform 0.094;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 0.094;
    }
}
